Autodesk.Revit.DB.NumberingSchema.ValidateCircularDependency(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.AdvancedNumberingSchemaSettings})
Tests whether the input schema settings are valid against ciruclar dependency.
document:
The document where the schema will be located.
settings:
Numbering schema settings to test.
Returns:
Returns True if the settings are valid; False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.SetScopeDefiningCategoriesAndOutputParam(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId)
Set the categories that define the scope of this numbering schema.
scopeCategories:
Categories that define the scope of the template
numberingParameterId:
The output parameter for the numbering
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given numberingParameterId is not compatible with the categories provided in scopeCategories for this numbering schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.SetScopeDefiningCategories(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Set the categories that define the scope of this numbering schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given scopeCategories are not valid for this numbering schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.ElementId,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},System.Int32)
Creates a numbering schema and registers it with a document.
aDoc:
The target docment where this schema will be created.
schemaName:
Name of the schema.
numberingParameterId:
The id of the parameter that represents the number of the numbered element.
scopeCategories:
The categories of the elements that will be numbered by this schema.
priority:
The priority of the schema
Returns:
Return schema which has not been added to a document or
registered with a numbering tracker. If schema was not created,
an exception is raised.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given schemaName has is invalid or allready in use.
-or-
The input schemaName already exists in the target document.
-or-
The given numberingParameterId is not compatible with the categories provided in scopeCategories for this numbering schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.ValidateCategoriesHaveBuiltInMatching(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Check if the input categories provide built-in matching.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.AllHasUptodateNumbers(Autodesk.Revit.DB.Document)
A check wether or not all schemas has up-to-date numbers.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetFormattedSampleForNumber(System.String,System.Int32)
Returns the formatted value of a number inside a sequence.
Remarks:
Method used to get the formatted value of a number in the sequence.
partition:
Name of the partition that identifies the sequence. The sequence must exist.
number:
Value for the number inside the sequence
Returns:
The formatted value for the number
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sequence partition does not exist in the schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetNumberOfSubelements
Get the number of subelements that the schema numbers.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetAdvancedNumberingSchemaSettings
Get the AdvancedNumberingSchemaSettings related to a schema instance.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetAllAdvancedNumberingSchemaSettingsForADocument(Autodesk.Revit.DB.Document)
Get all the AdvancedNumberingSchemaSettings related to the target document.
document:
Document where the numbering schemas are located.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.SetAllAdvancedNumberingSchemaSettingsForADocument(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.AdvancedNumberingSchemaSettings})
Document where the numbering schemas are located.
document:
Update the numbering schemas from the target document.
newSettings:
An array containing the new settings related to numbering for this document.
If the schema settings for a new schema name is added a new NumberingSchema will be created and applied to the document.
If the schema settings for a schema name is missing the target NumberingSchema will be removed.
Returns:
Returns true if the changes were integrated.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given newSettings are invalid.
-or-
The given newSettings have circular dependency.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.FilterToNumberableCategories(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.Document)
Filters a set of categorie IDs to only does that are usable in numbering.
categories:
The categories to filter.
document:
The document where the categories are located.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.SetScopeDefiningFilterAndOutputParam(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Sets the filter and the output parameter that is going to be used by this schema.
filterId:
Id for the ParameterFilterElement used to determine the scope for this schema.
numberingParameterId:
The output parameter for the numbering.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given numberingParameterId is not compatible with the filterId provided for this numbering schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.GetScopeDefiningCategories
Get the categories that define the scope of this numbering schema.
Remarks:
The categories from this set is determined by the filter that determines the scope for this schema.
Since:
2027

Autodesk.Revit.DB.NumberingSchema.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Int32)
Creates a numbering schema and registers it with a document.
aDoc:
The target docment where this schema will be created.
schemaName:
Name of the schema.
numberingParameterId:
The id of the parameter that represents the number of the numbered element.
filterId:
The filter used to determine the scope for this numbering schema, if one is provided, scopeCategories are ignored
priority:
The priority of the schema
Returns:
Return schema which has not been added to a document or
registered with a numbering tracker. If schema was not created,
an exception is raised.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given schemaName has is invalid or allready in use.
-or-
The input schemaName already exists in the target document.
-or-
The given numberingParameterId is not compatible with the filterId provided for this numbering schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.SetFormatting(Autodesk.Revit.DB.NumberingFormatSettings)
Set the NumberingFormatSettings for this schema.
formattingSettings:
Complete configuration settings for formatting numbers numbers in this schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input formattingSettings in not valid for this numbering schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.GetFormatting
Get the configuration for formatting.
Since:
2027

Autodesk.Revit.DB.NumberingSchema.AssignElementsToSequence(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},System.String)
Assigns the input elements to a sequence identified by the given partition name.
Remarks:
Elements will be added to the sequence by changing the value of their
Partition parameter. The difference between this method and changing the
parameter value explicitly is that the method here causes sequences to get assigned
and renumbered automatically and immediately without needing to commit a transaction first.
A numbering sequence for the given partition does not need to exist yet;
it will get created automatically by this method as needed.
The elements' numbers are likely to be affected by this operation, which is to be
expected. The values of assigned numbers will depend on whether the given sequence
already exists or not. In both cases the elements will get renumbered in order of their
original creation, but the first value will be 1 if the sequence does not exist yet,
respectively the next highest number if the sequence does exist already. The general
matching policy is always applied causing matched elements to have the same number.
A special case is considered when the given elements are all the elements
of one sequence and are being assigned to a sequence that does not exist yet.
Such an operation is identical in effect to the MoveSequence
method and all the elements will keep their numbers unchanged.
elementIds:
Ids of elements which are to be added to a sequence.
All elements must be valid and belonging to this schema.
partitionName:
Name of the target sequence's partition
Throws Autodesk.Revit.Exceptions.ArgumentException:
the given partitionName cannot be used as a valid name of a numbering partition
because it contains characters that are considered invalid, such as
non-printable characters or those that cannot be used in a file's name.
-or-
Thrown when elementIds contains Ids that are either invalid or of elements not from this schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
-or-
The input element/s in not a Rebar, an Reinforcement or a Coupler.
-or-
Thrown if there is an element that cannot have new value of the NUMBER_PARTITION_PARAM
parameter assigned. It may be an indication that the element is not free to be edited at present.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.MergeSequences(System.Collections.Generic.IList{System.String},System.String)
Merges all elements from given numbering sequences to a new sequence.
Remarks:
Upon a successful merge, all elements in the new merged sequence
will be renumbered in order of the element creation. There will be no gaps.
There must not be a sequence for the target partition in the schema yet,
otherwise an exception will be thrown.
This operation modifies the Partition parameter of all elements
in the sequences that are being merged. Therefore, all its elements
must be accessible for editing, otherwise this operation will fail.
sourcePartitions:
A collection of partition names identifying the sequences to be merged together.
There must be at least two names in the list. All the sequences must exist already.
newPartition:
Name of a new partition into which the source sequences will be merged.
Leading and trailing white space is ignored in the given string and will be removed automatically.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sourcePartitions list must contain at least two names.
-or-
Either one or more sequences in the sourcePartitions list does
not exist in the schema, or the list contains duplicated names.
-or-
The sequence newPartition does already exist in the schema.
-or-
the given newPartition cannot be used as a valid name of a numbering partition
because it contains characters that are considered invalid, such as
non-printable characters or those that cannot be used in a file's name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
-or-
The input element/s in not a Rebar, an Reinforcement or a Coupler.
-or-
Thrown if there is an element that cannot have new value of the NUMBER_PARTITION_PARAM
parameter assigned. It may be an indication that the element is not free to be edited at present.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.AppendSequence(System.String,System.String)
Appends all elements of one numbering sequence to the end of another sequence.
Remarks:
All numbers assigned to elements in the target sequence remain the same,
but numbers in the source sequence (the one getting appended) will change.
Elements that match elements in the target sequence will get the same
numbers assigned. Remaining elements will get consecutive numbers in the
creation order of the elements starting with the next highest
number available in the target sequence.
This operation modifies the Partition parameter of all elements
in the sequence that is getting appended. Therefore, all its elements
must be accessible for editing, otherwise this operation will fail.
Elements can be appended only to a sequence that already exists. In order to
reassign elements of one sequence to a partition that does not exist yet,
use either the MoveSequence or
MergeSequences methods.
fromPartition:
Name of the partition that determines which numbering sequence to append.
The sequence must exist already, otherwise an exception will be thrown.
toPartition:
Name of a partition into which the source sequence is going to be appended.
The sequence must exist already, otherwise an exception will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sequence fromPartition does not exist in the schema.
-or-
The sequence toPartition does not exist in the schema.
-or-
Given partition names fromPartition and toPartition must be different.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
-or-
The input element/s in not a Rebar, an Reinforcement or a Coupler.
-or-
Thrown if there is an element that cannot have new value of the NUMBER_PARTITION_PARAM
parameter assigned. It may be an indication that the element is not free to be edited at present.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.MoveSequence(System.String,System.String)
Moves all elements of a numbering sequence from one partition to another.
Remarks:
All numbers assigned to elements in the sequence remain the same.
This operation modifies the Partition parameter of all elements
in the given sequence. Therefore, all the elements must be accessible
for editing.
Elements can be moved only to a partition that does not exist yet. To move elements
to an existing partition use the AppendSequence method.
fromPartition:
Name of the partition that determines which numbering sequence to move.
The sequence must exist already, otherwise an exception will be thrown.
newPartition:
Name of a partition into which the source sequence is going to be moved.
The schema must not have a sequence for this partition yet
(i.e. the schema does not have an element that was assigned to such a partition.)
Leading and trailing white space is ignored in the given string and will be
removed automatically.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sequence fromPartition does not exist in the schema.
-or-
The sequence newPartition does already exist in the schema.
-or-
the given newPartition cannot be used as a valid name of a numbering partition
because it contains characters that are considered invalid, such as
non-printable characters or those that cannot be used in a file's name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
-or-
The input element/s in not a Rebar, an Reinforcement or a Coupler.
-or-
Thrown if there is an element that cannot have new value of the NUMBER_PARTITION_PARAM
parameter assigned. It may be an indication that the element is not free to be edited at present.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.ChangePartitioningValue(System.String,System.String)
Moves all elements of a numbering sequence from one partition to another.
fromPartition:
Name of the partition that determines which numbering sequence to move.
The sequence must exist already, otherwise an exception will be thrown.
newPartition:
Name of a partition into which the source sequence is going to be moved.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sequence fromPartition does not exist in the schema.
-or-
the given newPartition cannot be used as a valid name of a numbering partition
because it contains characters that are considered invalid, such as
non-printable characters or those that cannot be used in a file's name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
-or-
The value for the partition can only be changed if it is determined by one non-readonly Text parameter.
Since:
2027

Autodesk.Revit.DB.NumberingSchema.CanChangePartitioningValue
Returns true if this schema has partitions based on one parameter, that parameter is of type Text and it is modifiable.
Since:
2027

Autodesk.Revit.DB.NumberingSchema.ChangeNumber(System.String,System.Int32,System.Int32)
Replaces an existing number with a another one that does not exists in the same partition.
Remarks:
This method gives the caller the ability to overwrite any number used in a given
numbering sequence as long as the new number does not exist in the same sequence yet.
If an attempt is made to replace a number by another that already exists, an exception
will be thrown.
The new number will automatically be applied to all elements that bear the original
number, thus those elements must be free to be modified. A collection of element Ids
of all the affected elements is returned by this method.
The method is independent of the sequence's current starting number that might have
been assigned previously, meaning that the new number will be accepted even if it is
lower than the previously set start number in the sequence.
partition:
Name of the partition that identifies the sequence containing the number to be changed.
fromNumber:
Number to be changed; there must already be an element with that number in the sequence.
toNumber:
Number to change to; no element must have this number yet in the sequence.
Returns:
A collection of elements affected by the change of the number
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sequence partition does not exist in the schema.
-or-
The specified sequence does not contain any elements with the given fromNumber.
-or-
There already are elements with the given toNumber in the specified sequence.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The value of toNumber must be in the range from 1 to the maximum value for an Integer type
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
-or-
Can't access the number while an async operation is running.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.SwapNumber(System.String,System.Int32,System.Int32)
Replaces an existing number with a another one that exists in the same partition.
partition:
Name of the partition that identifies the sequence containing the number to be changed.
firstNumber:
Number to be swapped
secondNumber:
Number to be swapped
Returns:
A collection of elements affected by the change of the number
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sequence partition does not exist in the schema.
-or-
The specified sequence does not contain any elements with the given firstNumber.
-or-
The specified sequence does not contain any elements with the given secondNumber.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The value of firstNumber must be in the range from 1 to the maximum value for an Integer type
-or-
The value of secondNumber must be in the range from 1 to the maximum value for an Integer type
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
-or-
Can't access the number while an async operation is running.
Since:
2027

Autodesk.Revit.DB.NumberingSchema.ShiftNumbers(System.String,System.Int32)
Shifts all numbers in the sequence so the starting number has the given value.
Remarks:
A shift of all numbers in the sequence will be computed and applied
so the first (lowest) number in the sequence would have the given value.
All the other numbers will then be shifted relatively by the same amount.
Any existing gaps in the current numbering sequence will be preserved.
Shifts that would make the start number less than 1 or bigger than
Autodesk.Revit.DB.NumberingSchema.MaximumStartingNumber are considered invalid.
partition:
Name of the partition that identifies the sequence. The sequence must exist.
firstNumber:
Value for the new first (lowest) number of the sequence.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sequence partition does not exist in the schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
firstNumber must be in range between 1 and MaximumStartingNumber.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
-or-
Can't access the number while an async operation is running.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.RemoveGaps(System.String)
Removes gaps, if any, in a numbering sequence
Remarks:
Gaps are removed by shifting numbers above each gap down by the amount of
numbers skipped in the gap. The lowest number in the sequence will remain unchanged.
partition:
Name of the partition that identifies the sequence. The sequence must exist.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sequence partition does not exist in the schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
-or-
Can't access the number while an async operation is running.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetNumberingSequencesInfos
Returns all numbering sequences infos within this numbering schema.
Returns:
Collection of sequence infos
Since:
2027

Autodesk.Revit.DB.NumberingSchema.RemovePartitioningParameter(Autodesk.Revit.DB.NumberingParameter)
Remove a parameter that is used for partitioning elements in this schema.
Remarks:
This method makes sure that the document will be consistent when it comes to numbering before it exits.
partitioningParameter:
Parameter to remove from partitioning criteria in this schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input parameter is not valid for use in partitioning for numbering.
-or-
The schema does not have partitioning parameters
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.AddPartitioningParameter(Autodesk.Revit.DB.NumberingParameter)
Add a parameter to be used for partitioning elements in this schema.
Remarks:
This method makes sure that the document will be consistent when it comes to numbering before it exits.
partitioningParameter:
Parameter to add for partitioning elements in this schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input parameter is not valid for use in partitioning for numbering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.SetPartitioningParameters(System.Collections.Generic.ISet{Autodesk.Revit.DB.NumberingParameter})
Set the set of parameters used by this numbering schema to segregate a set of elements to a separate set of element where matching and numbering will be performed.
Remarks:
This method makes sure that the document will be consistent when it comes to numbering before it exits.
partitioningParameters:
The set of parameters used to divide elements into separate partitions for independent numbering.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input parameters are not valid for use in partitioning for numbering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.GetPartitioningParameters
Get the set of parameters used by this numbering schema to segregate a set of elements to a separate set of element where matching and numbering will be performed.
Returns:
Returns the set of parameters used to partition elements within the numbering schema.
Since:
2027

Autodesk.Revit.DB.NumberingSchema.GetUseBuiltInMatchingForCategories
Get the set of categories where the built-in matching criteria is used.
Returns:
Returns the set of categories that have built-in matching enabled for this schema.
Since:
2027

Autodesk.Revit.DB.NumberingSchema.GetCategoriesWitheBuiltInMatching
Returns a set of all the categories ids that support built-in matching.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.SetUseBuiltInMatchingForCategories(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Use the built-in matching criteria for a set of categories if one is available for a given category.
categories:
The set of categories to enable specialized built-in matching for.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not all the ids for the provided categories have built-in matching.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.RemoveMatchingParameter(Autodesk.Revit.DB.NumberingParameter)
Remove a parameter from the set of parameters used in matching elements so they would get the same number.
Remarks:
This method makes sure that the document will be consistent when it comes to numbering before it exits.
numberingParameter:
Parameter to remove from the matching criteria.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input parameter is not valid for use in matching for numbering.
-or-
The schema does not have matching parameters
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.AddMatchingParameter(Autodesk.Revit.DB.NumberingParameter)
Add a new parameter to the matching criteria for this numbering schema.
Remarks:
This method makes sure that the document will be consistent when it comes to numbering before it exits.
numberingParameter:
Parameter to add to the matching criteria.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input parameter is not valid for use in matching for numbering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.SetMatchingParameters(System.Collections.Generic.ISet{Autodesk.Revit.DB.NumberingParameter})
Sets the parameters used by a specific numbering schema for matching elements so they would get the same number.
Remarks:
This method makes sure that the document will be consistent when it comes to numbering before it exits.
matchingParameters:
Parameters used to determine which elements are assigned the same number.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input parameters are not valid for use in matching for numbering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.GetMatchingParameters
Returns the parameters used for matching elements in this schema.
Since:
2027

Autodesk.Revit.DB.NumberingSchema.GetNumberingSchema(Autodesk.Revit.DB.Document,System.String)
Returns an instance of the specified Numbering Schema in the given document.
document:
A document to get the numbering schema from.
schemaName:
The name of a schema to get.
Returns:
Instance of the specified schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given schemaName has is invalid or allready in use.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.GetNumberingInfoForReferences(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Get all the ElementInfos from a given document related to a set of references.
references:
References that represent the target elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Can't access the number while an async operation is running.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.ApplyExternalSorting(System.String,System.Collections.Generic.IDictionary{Autodesk.Revit.DB.Reference,System.Int32})
Applies an externally defined sort order to elements in a partition by assigning specific numbers.
Remarks:
This method allows external systems to define the numbering order by providing
a map of elements to their desired numbers. All elements in the partition must be
included in the sorted elements map, and all numbers must be within the valid range.
partition:
Name of the partition that identifies the sequence to be sorted.
sortedElements:
A map of element references to their assigned numbers, defining the new sort order.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sequence partition does not exist in the schema.
-or-
The provided sortedElements is incomplete or empty.
-or-
The provided sortedElements contains numbers outside the valid range (0 to INTMAX).
-or-
The references between the current sequence and the sorted sequence don't match.
-or-
Attempting to assign different numbers to matching references.
-or-
Attempting to assign the same number to non-matching references.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.GetNumberOfPartitions
Get the number of partitions managed by the schema.
Since:
2027

Autodesk.Revit.DB.NumberingSchema.FilterCompatibleOutputParameters(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.NumberingParameter},System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId)
Returns the subset of input parameters that are valid as numbering output parameters for the specified categories or filter.
document:
Revit Document.
parameters:
# Parameters to evaluate
categories:
Set of categories for the parameter.
filterId:
Filter that determines that will determine the scope.
If a valid filterId is provided the categories are ignored.
Returns:
Returns true if the parameter can be a numbering output parameter for the input categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.GetValidCategoriesForNumbering(Autodesk.Revit.DB.Document)
Gets a list of categories that can be used for a numbering.
document:
The document where the elements will be numbered.
Returns:
The IDs of all valid categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.GetAvailableParameters(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Document)
Get all the available parameters that can be used with numbering.
category:
The category for the element that will be numbered.
document:
The document where the elements will be numbered.
Returns:
The parameters that can be used for numbering in this category and from their associations.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.ScopeDefiningFilter
The id of the filter that determines the scope for this schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.SchemaType
Uniquly identifies this numbering schema.
Remarks:
This call has defined responses only for schemas that have in scope just one
category and that category is either OST_Rebar, OST_Coupler or OST_FabricReinforcement
Since:
2015

Autodesk.Revit.DB.NumberingSchema.NumberingParameterId
The output parameter where the numbering schema generate the final number can now also be set.
Remarks:
Values of numbers can be obtained by querying this parameter for the respective numbered element.
Note: The parameter can be changed directly, but if a value that already exists in the sequence is provided
a warning will be presented asking the user to select a proper course of action.
Programmatically with better control the value can be changed(with restrictions) using the Autodesk.Revit.DB.NumberingSchema.ChangeNumber(System.String,System.Int32,System.Int32) method.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given numberingParameterId is valid for this numbering schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingSchema.MatchGeometry
If true the matching for this numbering schema will consider the geometry of the input elements.
Since:
2027

Autodesk.Revit.DB.NumberingSchema.Priority
The priority for this numbering schema.
Remarks:
If two numbering schemas have the same scope and the same output parameter only the one with the highest priority will be executed.
If two schemas have the same priority, the same scope and the same output parameter one of them will be selected as the executing schema.
Since:
2027

Autodesk.Revit.DB.NumberingSchema.Enabled
True if the NumberingSchema is in use. False otherwise.
Since:
2027

Autodesk.Revit.DB.NumberingSchema.EnforceAwaitMode
Since:
2015

Autodesk.Revit.DB.NumberingSchema.UsingNOBLE
Since:
2015

Autodesk.Revit.DB.NumberingSchema.HasRoomRelatedParameters
Returns true if in the partitioning, matching or formatting there are parameters that require room associations.
Since:
2027

Autodesk.Revit.DB.NumberingSchema.BuiltIn
Returns true if the NumberingSchema is built in and it can't be edited.
Since:
2015

Autodesk.Revit.DB.NumberingSchema
A class to support assigning numbers to elements for the purpose of tagging and scheduling them.
Complete configuration settings for formatting.
Remarks:
Each NumberingSchema controls numbering for elements.
Instances of NumberingSchema are also elements.
Elements belonging to a particular schema based on a filter ScopeDefiningFilter. And are organized and numbered in sequences.
A sequence is a collection of elements that share the same numbering partition
as defined by their respective partition matching criteria. For a numbering sequence
to exist it must contain at least one element. In other words, a sequence is established once there is at least
one element of which the partitioning parameters have different values then on the  other elements.
If the last element is removed (deleted or if it's partitioning parameters have values corresponding to another partition)
the then empty sequence ceases to exist.
Elements get assigned to sequences either upon their creation (based on the then current numbering partition criteria)
In addition to directly or indirectly changing the partitioning criteria, numbering sequences can be
reorganized by using methods of the NumberingSchema class. The SetMatchingParameters method
changes the parameters used to assign the same number to multiple elements in the same schema.
The SetPartitioningParameters method sets the parameters used in the partitioning criteria
allowing a set of elements that have the same value for this set of parameters to be numbered independently.
The property MatchGeometry is used to match the elements in this schema based on their geometry.
The property UseBuiltInMatching is used to match the elements based on internal logic specific for that element.
All the matched or partitioned elements will be renumbered and matched as needed based on the matching algorithm.
Elements in different sequences are numbered independently, meaning that there may be elements with the same
number in two sequences even though the elements are different. Likewise, there may be perfectly identical
elements in two or more sequences bearing different numbers. However, within each one numbering sequence any
two matched elements will always have the same number, while different elements will never have the same
number within a numbering sequence. Revit refers to this rule as the matching policy.
Enumerable elements are always numbered automatically upon their creation. Each new element will get an
incrementally higher number. However, thanks to the matching policy, new elements that match existing elements
within the same sequence will get the same number assigned. Elements will keep their assigned numbers as long
as it is possible. This means, for example, that if some previously created elements (e.g. Rebar) get deleted,
all remaining elements (within the same numbering sequence) will keep their numbers, which may result in gaps in
the respective numbering sequence. Gaps can be removed by invoking RemoveGaps for sequences
in which gaps are not desired.
Numbers are stored as values of a numbering parameter on each numbered element. The Id of the parameter is obtained
by querying the Autodesk.Revit.DB.NumberingSchema.NumberingParameterId property. The value of the number can be obtained by querying for the value
of the parameter for the respective numbered element.
If set the system will try to maintain consistency and if the input number is in use an actionable warning will be displayed.
Even though numbers are always assigned automatically to all elements of a schema, the method
ChangeNumber gives the programmer a way to explicitly overwrite a specific number as long
as the new number is unique in the numbering sequence. The caller specifies a number to be changed and a new value that is
to be applied, providing the value does not exist yet in the same numbering sequence. Although this operation may seem rather
limited, it provides the programmer with freedom to change practically any number even if it may be achieved in multiple steps.
The input for this method is not the formatted version of the number, but the integer value used in the generation of the formatted number.
To obtain the non-formatted numbers see GetNumbers and GetNumberingInfoForReferences
Formatting is controlled trough the NumberingFormatSettings. To get access to this object see GetFormatting. and to set it SetFormatting.
The formatting getter returns a copy of the NumberingFormatSettings, if modified, the setter must be used for the changes to be applied.
Since:
2015